Agat/src/Catalogs/ЛокальныеАкты/ЛокальныеАкты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЛокальныеАкты</name>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйИсполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Н</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширениеФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУтверждения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Приложения</name>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>РасширениеФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Agat/src/Catalogs/ЛокальныеАкты/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Перем ПутьХранилищаКлиент; // Путь к архиву из константы 

///////////////////////////////////////////////////////////////////////////////////////////

// =============================================================================
// СЕРВЕРНЫЕ МЕТОДЫ (ИНИЦИАЛИЗАЦИЯ)
// ============================================================================= 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    // Получаем путь на сервере один раз
    ПутьХранилищаКлиент = Константы.ПутьХранилищаФайлов.Получить();
    
    // 1. Устанавливаем флаг "Только неисполненные" в значение Истина
    ОтборДействующие = ИСТИНА;
    
    // 2. Установка дат текущего месяца по умолчанию
    ДатаНачала = '00010101';
//    ДатаОкончания = КонецМесяца(ТекущаяДата());
    
    // 6. Применяем фильтры
    ОбновитьФильтрыНаСервере();
    
КонецПроцедуры

&НаСервере
Функция ПолучитьПутьХранилищаНаСервере()
	Возврат Константы.ПутьХранилищаФайлов.Получить();
КонецФункции

// =============================================================================
// КЛИЕНТСКИЕ МЕТОДЫ (ЛОГИКА И КОМАНДЫ)
// =============================================================================

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Подтягиваем путь на клиент, если он не заполнился
	Если ПустаяСтрока(ПутьХранилищаКлиент) Тогда
		ПутьХранилищаКлиент = ПолучитьПутьХранилищаНаСервере();
	КонецЕсли;
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////  


///////////////////////////////////////////////////////////////////////////////////////////
// EXCEL //////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////// 
// Универсальная загрузка данных из Excel  
// общий модуль - ЗагрузкаДанныхСервер  
// общая форма - ДиалогНастройкиКолонок 
///////////////////////////////////////////////////////////////////////////////////////////  
 
&НаКлиенте
Процедура ЗагрузитьИзExcel(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект);
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Excel файлы (*.xlsx;*.xlsm;*.xls)|*.xlsx;*.xlsm;*.xls";
	Диалог.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Если ВыбранныеФайлы = Неопределено Тогда Возврат; КонецЕсли;
	
	// Извлекаем путь (строку) из массива
	ЭтаФорма.ПутьКФайлу = ?(ТипЗнч(ВыбранныеФайлы) = Тип("Массив"), ВыбранныеФайлы[0], ВыбранныеФайлы);
	
	// ОПРЕДЕЛЯЕМ КОНКРЕТНЫЕ РЕКВИЗИТЫ ДЛЯ ЗАПОЛНЕНИЯ в коде
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить("НомерДокумента",          "Номер документа");
	СписокПолей.Добавить("ДатаДокумента",          "Дата документа");
	СписокПолей.Добавить("Наименование", "Сокращенное Наименование");
	СписокПолей.Добавить("ПолноеНаименование", "Полное Наименование");
//	СписокПолей.Добавить("Исполнители",         "Исполнители");
	СписокПолей.Добавить("ОтветственныйИсполнитель",          "Ответственный исполнитель");	
	СписокПолей.Добавить("СрокДействия",    "Срок действия");
//	СписокПолей.Добавить("ДатаИсполнения", "Дата исполнения");	
	СписокПолей.Добавить("Примечание",    "Примечание");	
	//////////////////////////////////////////////////////////////////////////////
	
	ПараметрыДиалога = Новый Структура;
	ПараметрыДиалога.Вставить("СписокПолей",    СписокПолей);
	ПараметрыДиалога.Вставить("СписокЛистов",   ЗагрузкаДанныхСервер.ПолучитьСписокЛистов(ЭтаФорма.ПутьКФайлу));
	ПараметрыДиалога.Вставить("ИмяСправочника", "ЛокальныеАкты");

	// Открытие ОТДЕЛЬНОГО БЛОКИРУЮЩЕГО ОКНА
	ОповещениеЗакрытия = Новый ОписаниеОповещения("ПослеНастройки", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ДиалогНастройкиКолонок", 
	             ПараметрыДиалога, 
	             ЭтотОбъект, 
	             Истина, // Уникальность
	             , 
	             , 
	             ОповещениеЗакрытия, 
	             РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ПослеНастройки(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда Возврат; КонецЕсли;

	Попытка
		Лог = ЗагрузкаДанныхСервер.ЗагрузитьДанные(
			Неопределено, 
			ЭтаФорма.ПутьКФайлу, 
			Результат.НастройкиКолонок, 
			Результат.СтартоваяСтрока, 
			Результат.КонечнаяСтрока, 
			Результат.ИмяСправочника, 
			Результат.ИмяЛиста
		);
		Элементы.Список.Обновить();
		ПоказатьОповещениеПользователя("Загрузка завершена", , "Успешно: " + Лог.Успешно);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры
///////////////////////////////////////////////////////////////////////////////////////////     


///////////////////////////////////////////////////////////////////////////////////////////  
// ПРИЛОЖЕНИЕ // Сохранение / Просмотр сохраненых / Удаление в архив приложенных файлов  
///////////////////////////////////////////////////////////////////////////////////////////

// Команда открытия файла (использует скрытый UUID)
&НаКлиенте
Асинх Процедура КомандаДействие(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено ИЛИ ПустаяСтрока(ТекущиеДанные.РасширениеФайла) Тогда
		Возврат;
	КонецЕсли;

	// Сборка пути: Путь + UUID + Расширение
	// СтрШаблон исключает ошибку "Преобразование к типу Число"
	ПутьВАрхиве = СтрШаблон("%1\%2%3", 
		ПутьХранилищаКлиент, 
		Строка(ТекущиеДанные.УникальныйИдентификатор), 
		ТекущиеДанные.РасширениеФайла);
	
	ФайлИсточник = Новый Файл(ПутьВАрхиве);
	Если НЕ Ждать ФайлИсточник.СуществуетАсинх() Тогда
		ПоказатьПредупреждение(, "Файл не найден в хранилище!");
		Возврат;
	КонецЕсли;

	// Формируем красивое имя: Наименование_Номер_Дата (в формате 24-01-2026)
	СтрДата = Формат(ТекущиеДанные.ДатаДокумента, "ДФ=dd-MM-yyyy");
	
	КрасивоеИмя = СтрШаблон("%1_№ %2_от %3%4", 
		ТекущиеДанные.Наименование, 
		ТекущиеДанные.НомерДокумента, 
		СтрДата, 
		ТекущиеДанные.РасширениеФайла);

	// Очистка от запрещенных символов Windows (\ / : * ? " < > |)
	СимволыЗамены = "\/:*?""<>|";
	Для Поз = 1 По СтрДлина(СимволыЗамены) Цикл
		КрасивоеИмя = СтрЗаменить(КрасивоеИмя, Сред(СимволыЗамены, Поз, 1), "-");
	КонецЦикла;

	// Подготавливаем временную копию и открываем асинхронно
	ПутьОткрытия = КаталогВременныхФайлов() + КрасивоеИмя;
	
	Попытка
		КопироватьФайл(ПутьВАрхиве, ПутьОткрытия);
		Ждать ЗапуститьПриложениеАсинх(ПутьОткрытия); 
	Исключение
		ПоказатьПредупреждение(, "Ошибка открытия. Убедитесь, что файл не занят другим процессом.");
	КонецПопытки;

КонецПроцедуры

// Событие при смене строки: обновляет кнопку на панели 
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	КнопкаПанели = Элементы.Найти("КнопкаДействие"); 
	
	Если КнопкаПанели <> Неопределено Тогда
		
		// Проверяем наличие файла по РасширениеФайла
		Если ТекущиеДанные <> Неопределено И НЕ ПустаяСтрока(ТекущиеДанные.РасширениеФайла) Тогда
			// Файл есть — кнопка активна, иконка ПРОСМОТР
			КнопкаПанели.Картинка  = БиблиотекаКартинок.картинка_2; 
			КнопкаПанели.Заголовок = "Просмотреть файл";
			КнопкаПанели.Доступность = Истина;
		Иначе
			// Файла нет — кнопка неактивна
			КнопкаПанели.Картинка  = БиблиотекаКартинок.картинка_1; 
			КнопкаПанели.Заголовок = "Файл отсутствует";
			КнопкаПанели.Доступность = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
///////////////////////////////////////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////////////////////////////////////
// ФИЛЬТР /////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////// 

&НаСервере
Функция ПолучитьУсловияОтбора()
    
    Условия = Новый Массив;
    
    // 1. Дата документа
    Если ЗначениеЗаполнено(ДатаНачала) Тогда
        Условия.Добавить("ДатаДокумента > &ПарДатаНачала");
    КонецЕсли;
    
    // 2. Номер документа
    Если ЗначениеЗаполнено(ОтборНомерДокумента) Тогда
        Условия.Добавить("НомерДокумента ПОДОБНО &ПарНомерДокумента");
    КонецЕсли;
    
    // 3. Наименование (частичное совпадение)
    Если ЗначениеЗаполнено(ОтборНаименование) Тогда
        Условия.Добавить("Наименование ПОДОБНО &ПарНаименование");
    КонецЕсли;
    
    // 4. Полное наименование (частичное совпадение)
    Если ЗначениеЗаполнено(ОтборПолноеНаименование) Тогда
        Условия.Добавить("ПолноеНаименование ПОДОБНО &ПарПолноеНаименование");
    КонецЕсли;
    
    // 5. ОтборДействующие
    Если ОтборДействующие = ИСТИНА Тогда
        Условия.Добавить("СрокДействия <= КонецДня(ТекущаяДата())");
    ИначеЕсли ОтборДействующие = ЛОЖЬ Тогда
        Условия.Добавить("СрокДействия = '00010101'");
    КонецЕсли;

    // 6. Н (Не действует)
    Если ОтборН = ИСТИНА Тогда
        Условия.Добавить("Н = ИСТИНА");
    ИначеЕсли ОтборН = ЛОЖЬ Тогда
        Условия.Добавить("Н = ЛОЖЬ");
    КонецЕсли;
  
    // 7. Период
    Если ЗначениеЗаполнено(ДатаНачала) И ДатаНачала <> '00010101' Тогда
        Условия.Добавить("СрокИсполнения >= &ДатаНачала");
    КонецЕсли;
    
    Если ЗначениеЗаполнено(ДатаОкончания) И ДатаОкончания <> '00010101' Тогда
        Условия.Добавить("СрокДействия <= &ДатаОкончания");
    КонецЕсли;
    
    // Формируем результат
    Если Условия.Количество() = 0 Тогда
        Возврат "ИСТИНА";
    Иначе
        Возврат СтрСоединить(Условия, " И ");
    КонецЕсли;
    
КонецФункции

&НаСервере
Процедура УстановитьПараметрыЗапроса(Запрос)
    // определение пустой даты	
    Запрос.УстановитьПараметр("ПустаяДата", '00010101');
    
    // ДатаНачала
    Если ЗначениеЗаполнено(ДатаНачала) Тогда
        Запрос.УстановитьПараметр("ПарДатаДокумента", НачалоДня(ДатаНачала));
        Запрос.УстановитьПараметр("ПарДатаНачала", НачалоДня(ДатаНачала));
    КонецЕсли;
    
    // Номер документа   
    Если ЗначениеЗаполнено(ОтборНомерДокумента) Тогда
        Запрос.УстановитьПараметр("ПарНомерДокумента", "%" + СокрЛП(ОтборНомерДокумента) + "%");
    КонецЕсли;
    
    // Наименование (частичное совпадение)
    Если ЗначениеЗаполнено(ОтборНаименование) Тогда
        Запрос.УстановитьПараметр("ПарНаименование", "%" + СокрЛП(ОтборНаименование) + "%");
    КонецЕсли;
    
    // Полное наименование (частичное совпадение)
    Если ЗначениеЗаполнено(ОтборПолноеНаименование) Тогда
        Запрос.УстановитьПараметр("ПарПолноеНаименование", "%" + СокрЛП(ОтборПолноеНаименование) + "%");
    КонецЕсли;
    
    // Период    
    Если ЗначениеЗаполнено(ДатаНачала) Тогда
        Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
    КонецЕсли;
    
    Если ЗначениеЗаполнено(ДатаОкончания) Тогда
        Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
    КонецЕсли;
  
КонецПроцедуры	
///////////////////////////////////////////////////////////////////////////////////////////

// ФИЛЬТР + СЧЕТЧИК /////////////////////////////////////////////////////////////////////// 
&НаСервере
Процедура ОбновитьФильтрыНаСервере(ОбновлятьСчетчик = Истина)
    
    // Проверяем, что Список существует
    Если Список = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    // Очистка настроек списка
    НастройкиСписка = Список.КомпоновщикНастроек.Настройки;
    ОтборСписка = НастройкиСписка.Отбор;
    ОтборСписка.Элементы.Очистить();
    
    // ============ ФОРМИРУЕМ УСЛОВИЯ ДЛЯ СЧЕТЧИКА ============
    УсловияСчетчика = Новый Массив;
    УсловияСчетчика.Добавить("ИСТИНА");
    
    // Создаем запрос для счетчика
    ЗапросСчетчик = Новый Запрос;
    
    // Устанавливаем параметр текущей даты
    ТекущаяДатаСервер = ТекущаяДата();
    ЗапросСчетчик.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСервер);
    
    // 1. Фильтр по дате документа
    Если ЗначениеЗаполнено(ДатаНачала) Тогда
        УсловияСчетчика.Добавить("ДатаДокумента >= &ПарДатаДокумента");
        ЗапросСчетчик.УстановитьПараметр("ПарДатаДокумента", НачалоДня(ДатаНачала));
        ДобавитьЭлементОтбора(ОтборСписка, "ДатаДокумента", НачалоДня(ДатаНачала), ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
    КонецЕсли;
    
    // 2. Фильтр по номеру документа
    Если ЗначениеЗаполнено(ОтборНомерДокумента) Тогда
        УсловияСчетчика.Добавить("НомерДокумента ПОДОБНО &ПарНомерДокумента");
        ЗапросСчетчик.УстановитьПараметр("ПарНомерДокумента", "%" + СокрЛП(ОтборНомерДокумента) + "%");
        ДобавитьЭлементОтбора(ОтборСписка, "НомерДокумента", ОтборНомерДокумента, ВидСравненияКомпоновкиДанных.Содержит);
    КонецЕсли;
    
    // 3. Фильтр по наименованию (частичное совпадение)
    Если ЗначениеЗаполнено(ОтборНаименование) Тогда
        УсловияСчетчика.Добавить("Наименование ПОДОБНО &ПарНаименование");
        ЗапросСчетчик.УстановитьПараметр("ПарНаименование", "%" + СокрЛП(ОтборНаименование) + "%");
        ДобавитьЭлементОтбора(ОтборСписка, "Наименование", ОтборНаименование, ВидСравненияКомпоновкиДанных.Содержит);
    КонецЕсли;
    
    // 4. Фильтр по полному наименованию (частичное совпадение)
    Если ЗначениеЗаполнено(ОтборПолноеНаименование) Тогда
        УсловияСчетчика.Добавить("ПолноеНаименование ПОДОБНО &ПарПолноеНаименование");
        ЗапросСчетчик.УстановитьПараметр("ПарПолноеНаименование", "%" + СокрЛП(ОтборПолноеНаименование) + "%");
        ДобавитьЭлементОтбора(ОтборСписка, "ПолноеНаименование", ОтборПолноеНаименование, ВидСравненияКомпоновкиДанных.Содержит);
    КонецЕсли;
    
    // 5. Н
    Если ОтборН = ИСТИНА Тогда
        УсловияСчетчика.Добавить("Н = ИСТИНА");
        ДобавитьЭлементОтбора(ОтборСписка, "Н", Истина); 
//==============================================================		
		ДобавитьЭлементОтбора(ОтборСписка, "СрокДействия", ТекущаяДатаСервер, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);
        УсловияСчетчика.Добавить("СрокДействия <= &ТекущаяДата");
 //==============================================================
		//   ИначеЕсли ОтборН = Ложь Тогда
  //       УсловияСчетчика.Добавить("Н = ЛОЖЬ");
  //       ДобавитьЭлементОтбора(ОтборСписка, "Н", Ложь);
    КонецЕсли;
    
    // 6. Действующие (ИСПРАВЛЕНО)
    Если ОтборДействующие = ИСТИНА Тогда
//        ДобавитьЭлементОтбора(ОтборСписка, "СрокДействия", ТекущаяДатаСервер, ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
 //       УсловияСчетчика.Добавить("СрокДействия >= &ТекущаяДата");
//==============================================================
УсловияСчетчика.Добавить("Н = ЛОЖЬ");
ДобавитьЭлементОтбора(ОтборСписка, "Н", Ложь);
//==============================================================
    ИначеЕсли ОтборДействующие = Ложь Тогда
 //       ДобавитьЭлементОтбора(ОтборСписка, "СрокДействия", '00010101', ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
 //       УсловияСчетчика.Добавить("СрокДействия > &ПустаяДата");
//		ЗапросСчетчик.УстановитьПараметр("ПустаяДата", '00010101');
    КонецЕсли;
    
    // 7. Период
    Если ЗначениеЗаполнено(ДатаНачала) И ДатаНачала <> '00010101' Тогда
        УсловияСчетчика.Добавить("ДатаДокумента >= &ДатаНачала");
        ЗапросСчетчик.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
        // Уже добавили отбор выше, не дублируем
    КонецЕсли;
    
    Если ЗначениеЗаполнено(ДатаОкончания) И ДатаОкончания <> '00010101' Тогда
        УсловияСчетчика.Добавить("СрокДействия <= &ДатаОкончания");
        ЗапросСчетчик.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
        ДобавитьЭлементОтбора(ОтборСписка, "СрокДействия", КонецДня(ДатаОкончания), ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);
    КонецЕсли;
    
    // ============ ВЫПОЛНЯЕМ ЗАПРОС СЧЕТЧИКА ============
    Если ОбновлятьСчетчик Тогда
        // Удаляем первое условие "ИСТИНА", если есть другие условия
        Если УсловияСчетчика.Количество() > 1 И УсловияСчетчика[0] = "ИСТИНА" Тогда
            УсловияСчетчика.Удалить(0);
        КонецЕсли;
        
        // Формируем текст запроса
        Если УсловияСчетчика.Количество() = 0 Тогда
            ТекстЗапроса = "ВЫБРАТЬ КОЛИЧЕСТВО(Ссылка) КАК КолВо ИЗ Справочник.ЛокальныеАкты";
        Иначе
            ТекстЗапроса = "ВЫБРАТЬ КОЛИЧЕСТВО(Ссылка) КАК КолВо ИЗ Справочник.ЛокальныеАкты ГДЕ " + СтрСоединить(УсловияСчетчика, " И ");
        КонецЕсли;
        
        ЗапросСчетчик.Текст = ТекстЗапроса;
        
        Попытка
            Выборка = ЗапросСчетчик.Выполнить().Выбрать();
            Если Выборка.Следующий() Тогда
                ТекстКоличествоОтобаженных = "" + Формат(Выборка.КолВо, "ЧГ=0") + "";
            Иначе
                ТекстКоличествоОтобаженных = "(0)";
            КонецЕсли;
        Исключение
            ТекстКоличествоОтобаженных = "(ош)";
            Сообщить("Ошибка запроса счетчика: " + ОписаниеОшибки());
        КонецПопытки;
    КонецЕсли;
    
КонецПроцедуры
&НаСервере
Функция ДобавитьЭлементОтбора(ГруппаОтбора, ИмяПоля, Значение = Неопределено, ВидСравнения = Неопределено)
    НовыйЭлемент = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
    
    Если ВидСравнения = Неопределено Тогда
        НовыйЭлемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    Иначе
        НовыйЭлемент.ВидСравнения = ВидСравнения;
    КонецЕсли;
    
    Если Значение <> Неопределено Тогда
        НовыйЭлемент.ПравоеЗначение = Значение;
    КонецЕсли;
    
    НовыйЭлемент.Использование = Истина;
    НовыйЭлемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
    
    Возврат НовыйЭлемент;
КонецФункции
///////////////////////////////////////////////////////////////////////////////////////////

// Обработчики событий Фильтра
///////////////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
    ОбновитьФильтрыНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
    ОбновитьФильтрыНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОтборНомерДокументаПриИзменении(Элемент)
    ОбновитьФильтрыНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОтборНаименованиеПриИзменении(Элемент)
    ОбновитьФильтрыНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОтборПолноеНаименованиеПриИзменении(Элемент)
    ОбновитьФильтрыНаСервере(Истина);
КонецПроцедуры


&НаКлиенте
Процедура ОтборДействующиеПриИзменении(Элемент)
    ОбновитьФильтрыНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОтборНПриИзменении(Элемент)
    ОбновитьФильтрыНаСервере(Истина);
КонецПроцедуры
///////////////////////////////////////////////////////////////////////////////////////////
